{
  "backend/main.mo": "Empty Motoko actor with no methods or logic.",
  "feature_evidence.json": "Feature evidence report structure containing an empty features list.",
  "frontend-file-summaries.txt": "Prewritten summaries of various frontend React files describing components, effects, hooks, styles, and configuration.",
  "frontend/index.css": "Tailwind base stylesheet defining extensive OKLCH color variables, dark mode variants, and global background/text styles.",
  "frontend/index.html": "Basic HTML entry point loading the app root and main TypeScript bundle with font preconnects.",
  "frontend/src/App.tsx": "Main React app managing screen transitions, animated gradients, moving NO button behavior, and triggering confetti/fireworks effects.",
  "frontend/src/components/effects/ConfettiCanvas.tsx": "Canvas component rendering falling animated confetti particles with gravity and rotation.",
  "frontend/src/components/effects/FireworksCanvas.tsx": "Canvas component generating randomized fireworks that launch, explode into particles, and fade out over time.",
  "frontend/src/components/WarningGate.tsx": "Warning screen component showing alerts, risks, and a shareable link with copy functionality before continuing.",
  "frontend/src/config/deploymentDomain.ts": "Defines deployment domain and generates a full deployment URL depending on environment.",
  "frontend/src/hooks/useActor.ts": "Hook that creates and manages a backend actor based on Internet Identity and refreshes dependent queries when identity changes.",
  "frontend/src/hooks/useInternetIdentity.ts": "Provides a React context and provider for managing Internet Identity authentication and exposes login, logout, and identity state.",
  "frontend/src/hooks/useQueries.ts": "Empty placeholder file indicating no backend queries are required.",
  "frontend/src/hooks/useShareLink.ts": "Creates a shareable URL and provides clipboard copy logic with simple success/error state.",
  "frontend/src/index.css": "Defines global styles, Tailwind layers, custom animations, and theme variables for the app.",
  "frontend/src/main.tsx": "Bootstraps the React app with QueryClient and InternetIdentityProvider before rendering App.",
  "frontend/tailwind.config.js": "Configures Tailwind with custom colors, fonts, animations, and plugins for the project.",
  "project_state.json": "Stores project metadata, versioning, and pending feature requests."
}